<?php
return [
    // GitHub
    // Загальне
    'stars'                     => 'Зірки',
    'forks'                     => 'Форки',
    'issues'                    => 'Проблеми',
    'watchers'                  => 'Спостерігачі',
    'release'                   => 'Реліз',
    'license'                   => 'Ліцензія',
    'top_language'              => 'Основна мова',

    // Метрики (Всі репозиторії)
    'stars_all'                 => 'Зірки (Всі)',
    'forks_all'                 => 'Форки (Всі)',
    'issues_all'                => 'Проблеми (Всі)',
    'watchers_all'              => 'Спостерігачі (Всі)',
    'downloads_all'             => 'Завантаження (Всі)',
    'branches_all'              => 'Гілки (Всі)',
    'size_all'                  => 'Розмір (Всі)',
    'top_languages_all'         => 'Основні мови (Всі)',
    'pull_requests_all'         => 'Pull Request (Всі)',
    'prs_merged_all'            => 'Об’єднані PR (Всі)',
    'subscribers_count_all'     => 'Підписники (Всі)',
    'success_rate_all'          => 'Рівень успішності (Всі)',
    'files_all'                 => 'Файли (Всі)',
    'tags_all'                  => 'Теги (Всі)',
    'projects_all'              => 'Проекти (Всі)',
    'releases_all'              => 'Релізи (Всі)',

    // Метрики (Окремий репозиторій)
    'lines'                     => 'Рядки',
    'lines_added'               => 'Додані рядки',
    'lines_deleted'             => 'Видалені рядки',
    'milestones'                => 'Етапи',
    'milestones_open'           => 'Етапи (Відкриті)',
    'milestones_closed'         => 'Етапи (Закриті)',
    'milestones_all'            => 'Етапи (Всі)',
    'milestones_allopen'        => 'Етапи (Всі відкриті)',
    'milestones_allclosed'      => 'Етапи (Всі закриті)',
    'downloads'                 => 'Завантаження',
    'downloads_latest'          => 'Завантаження останнього релізу',
    'branches'                  => 'Гілки',
    'size'                      => 'Розмір',
    'created_at'                => 'Створено',
    'pull_requests'             => 'Pull Request',
    'prs_merged'                => 'Об’єднані PR',
    'subscribers_count'         => 'Підписники',
    'success_rate'              => 'Рівень успішності',
    'files'                     => 'Файли',
    'tags'                      => 'Теги',
    'projects'                  => 'Проекти',
    'releases'                  => 'Релізи',

    // Push & Commit
    'push_date'                 => 'Останній Push (Дата)',
    'push_time'                 => 'Останній Push (Час)',
    'push_datetime'             => 'Останній Push',
    'push_lines'                => 'Рядки Push',
    'push_info'                 => 'Інформація останнього Push',
    'commit_date'               => 'Останній Commit (Дата)',
    'commit_time'               => 'Останній Commit (Час)',
    'commit_datetime'           => 'Останній Commit',
    'commit_lines'              => 'Рядки Commit',
    'commit_info'               => 'Інформація останнього Commit',

    // Метрики користувача
    'repos_count'               => 'Публічні репозиторії',
    'follower'                  => 'Фоловери',
    'follower_name'             => 'Останній фоловер',
    'following'                 => 'Підписки',
    'following_name'            => 'Остання підписка',

    // Gists
    'gists'                     => 'Gists',
    'gist_not_found'            => 'Gist не знайдено',
    'gist_size'                 => 'Розмір Gist',
    'gist_forks'                => 'Форки Gist',
    'gists_list_short'          => 'Останні Gists',
    'gists_listall'             => 'Всі Gists',
    'gists_size'                => 'Загальний розмір',
    'gists_date'                => 'Останній Gist',
    'gists_forks'               => 'Форки Gist',

    // Перевірка версії
    'version_check'             => 'Перевірка версії',
    'no_version_found'          => 'Версія не вказана',
    'new_release_available'     => 'Доступна нова версія:',
    'check_release'             => 'Перевірити реліз',
    'check_ok'                  => 'OK',
    'error'                     => 'Помилка',

    // Інформація користувача
    'name_label'                => 'Привіт, мене звати',
    'company_label'             => 'Компанія',
    'no_company'                => 'Немає даних',
    'location_label'            => 'Я з',
    'no_location'               => 'Місце не вказано',
    'status_label'              => 'Статус',
    'no_status'                 => 'Статус не встановлено',
    'account_created'           => 'Акаунт створено',
    'last_updated'              => 'Останнє оновлення',
    'time_year_singular'        => 'Рік',
    'time_year_plural'          => 'Роки',
    'time_month_singular'       => 'Місяць',
    'time_month_plural'         => 'Місяці',
    'time_day_singular'         => 'День',
    'time_day_plural'           => 'Дні',

    // Деталі Commit/Push
    'commits_repo'              => 'Коміти',
    'commits_all'               => 'Коміти (Всі)',
    'commits_last'              => 'Останній коміт (Дата)',
    'commits_last_info'         => 'Останній коміт (Інфо)',

    // Дискусії
    'discussions_count'         => 'Дискусії',
    'discussions_lastdate'      => 'Остання дискусія (Дата)',
    'discussions_lastupdate'    => 'Остання дискусія (Оновлення)',
    'discussions_lasttitle'     => 'Назва останньої дискусії',
    'discussions_lastauthor'    => 'Автор останньої дискусії',

    // Codeberg
    // Загальне / Основи
    'name'                          => 'Назва',
    'language'                      => 'Мова',
    'updated_at'                    => 'Останнє оновлення',
    'branch_default'                => 'Гілка за замовчуванням',

    // Проблеми (Окремо + всі репозиторії)
    'issues_open'                   => 'Проблеми (Відкриті)',
    'issues_closed'                 => 'Проблеми (Закриті)',
    'issues_total'                  => 'Проблеми (Всі)',
    'issues_allopen'                => 'Проблеми (Всі відкриті)',
    'issues_all'                    => 'Проблеми (Всі репозиторії)',
    'issues_allclosed'              => 'Проблеми (Всі закриті)',

    // Pull Request (Окремо + всі)
    'prs_total'                     => 'PR (Всі)',
    'prs_open'                      => 'PR (Відкриті)',
    'prs_closed'                    => 'PR (Закриті)',
    'prs_all'                       => 'PR (Всі репозиторії)',
    'prs_allopen'                   => 'PR (Всі відкриті)',
    'prs_allclosed'                 => 'PR (Всі закриті)',

    // Релізи та версії
    'release_label'                 => 'Останній реліз',
    'release_tag_label'             => 'Останній тег',
    'release_check_label'           => 'Перевірка релізу',
    'release_new_label'             => 'Доступний новий реліз',
    'releases_label'                => 'Усього релізів',

    // Користувач
    'name_label'                    => 'Привіт, мене звати',
    'location_label'                => 'Я з',
    'no_location'                   => 'Десь у матриці 🌌',
    'no_company'                    => 'Н/Д',
    'created'                       => 'Створено',
    'followers'                     => 'Фоловери',
    'following'                     => 'Підписки',
    'stars_give'                    => 'Вручено зірок',
    'repos'                         => 'Публічні репозиторії',
    'register_on'                   => 'Зареєстрований',
    'register_since'                => 'Зареєстрований з',

    // Коміти
    'last_commit'                   => 'Останній коміт',

    // Етапи
    'milestones_info'               => 'Інфо етапів',
    'milestones_info_open'          => 'Відкриті етапи (Інфо)',
    'milestones_info_closed'        => 'Закриті етапи (Інфо)',
    'milestones_all_open'           => 'Етапи (Всі відкриті)',
    'milestones_all_closed'         => 'Етапи (Всі закриті)',

    // Завантаження
    'downloads'                     => 'Завантаження',
    'downloads_latest'              => 'Завантаження останнього релізу',
    'downloads_all'                 => 'Завантаження (Всі)',

    // Додаткові ярлики для сум
    'stars_all'                     => 'Зірки (Всі)',
    'watchers_all'                  => 'Спостерігачі (Всі)',
    'forks_all'                     => 'Форки (Всі)',
    'size_all'                      => 'Розмір (Всі)',
    'releases_all'                  => 'Релізи (Всі)',
];
